export const words = [
  "մկնիկ",
  "լոլիկ",
  "օդափոխիչ",
  "գրատախտակ",
  "մոլագար",
  "հիստերիա",
  "գլուխգործոց",
  "ասպետ",
  "վանդալիզմ",
  "շրջանակ",
  "մոխիր",
  "կաղամբ",
  "Ջեյմս Կուկ",
  "պահարան",
  "զեբր",
  "հոմանիշ",
  "կարծիք",
  "գտնել",
  "հայթհայթել",
  "ծնել",
  "սրբություն",
  "սարկավագ",
  "վաղեմի",
  "հայեցակարգ",
  "զվարճալի",
  "մաշկ",
  "կարիճ",
  "պահմտոցի",
  "անդառնալի",
  "աղնիվ",
  "սրամիտ",
  "Ակսել Բակունց",
  "Վիկտոր Հյուգո",
  "Վալենսիա",
  "Նիագարա",
  "Բանգկոկ",
  "Ալժիր",
  "վանդալիզմ",
  "ճոճանակ",
  "հանդիպակաց",
  "սրտաճմլիկ",
  "քոթոթ",
  "վայրենի",
  "սիրամարգ",
  "վարդակակաչ",
  "վարակիչ",
  "գիշերել",
  "ալեկոծ",
  "սաստիկ",
  "հրավտանգ",
  "Ալֆրեդ Նոբել",
  "անգրագետ",
];

export function wordGenerator() {
  const wordsArr = [];

  for (let i = 0; i < 7; i++) {
    const index = Math.floor(Math.random() * 52);
    wordsArr.push(words[index]);
  }
  return wordsArr;
}
